# 姓名来源于偶像大师系列

lastname = ('天海', '如月', '萩原', '高槻', '秋月', '三浦', '水濑', '菊地', '双海', '星井', '我那霸', '四条', '音无',
 '黑井', '天濑', '伊集院', '御手洗',
 '小早川', '东豪寺', '朝比奈', '三条', '佐野', '薮下',
 '日高', '水谷', '冈本', '樱井',
 '岛村', '中野', '水本', '福山', '椎名', '今井', '持田', '三村', '奥山', '间中', '小日向', '绪方', '五十岚', '柳濑', '江上', '长富', '横山', '关', '太田', '栋方', '藤本', '大原', '游佐', '大沼', '一之濑', '前川', '赤西瑛', '松原', '相原', '宫本', '小早川', '西园寺', '双叶', '杨', '桃井', '凉宫',  '月宫', '兵藤', '丹羽', '道明寺', '柳', '井村', '日下部', '榊原', '舆水', '安斋', '浅野', '大西', '安部', '工藤', '栗原', '古贺', '佐久间', '村松',  '白菊', '早坂', '有浦', '乙仓', '原田', '池袋', '辻野', '黑埼', '白雪',
 '涩谷', '黑川', '松本', '桐野', '高桥', '相川', '川岛', '神谷', '上条', '荒木', '东乡', '多田', '水木', '佐佐木', '三船', '服部', '木场', '藤原', '新田', '水野', '古泽', '橘', '鹭泽', '八神', '浅利', '松永', '小室', '高峰', '高垣', '神崎', '伊集院', '柊', '北条', '濑名', '绫濑', '佐城', '篠原', '和久井', '吉冈', '梅木', '白坂', '岸部', '氏家', '西川保', '成宫', '藤居', '盐见', '胁山', '冈崎', '速水', '大石', '松尾', '森久保', '大和', '结城', '二宫', '桐生', '望月', '鹰富士', '砂冢', '久川',
 '本田', '高森', '并木', '龙崎', '木村', '松山', '齐藤', '泽田', '矢口', '赤城', '爱野', '真锅', '大槻', '姬川', '喜多见', '上田', '海老原', '及川', '小关', '卫藤', '片桐', '堀', '西岛', '的场', '财前', '依田', '相叶', '野野村', '滨川', '若林', '城崎', '仙崎', '日野', '诸星', '十时', '相马', '槙原', '向井', '市原', '喜多', '杉坂', '北川', '小松', '三好', '难波', '滨口', '村上', '土屋', '首藤', '冴岛', '佐藤', '南条', '梦见',
 '春日', '田中', '佐竹', '德川', '七尾', '高山', '松田', '高坂', '中谷', '矢吹', '横山', '福田',  '最上', '所', '天空桥', '北泽', '舞滨', '二阶堂', '真壁', '百濑', '永吉', '周防', '白石',  '伊吹', '岛原', '箱崎', '野野原', '望月', '木下', '马场', '大神', '丰川', '宫尾', '篠宫', '北上', '樱守',
 '樱木', '风野', '八宫', 	'月冈', '白濑', '三峰', '幽谷', '小宫', '园田', '西城', '杜野', '有栖川', '大崎', '桑山', '芹泽', '黛', '和泉', '浅仓', '樋口', '福丸', '市川', '七草'
)

firstname = ('春香', '千早', '雪步', '弥生', '律子', '梓', '伊织', '真', '亚美', '真美', '美希', '响', '贵音', '小鸟',
 '玲音', '诗花', '冬马',
 '瑞树', '丽华', '凛', '智美', '美心', '幸惠',
 '爱', '绘理', '凉', '真奈美', '梦子',
 '卯月', '有香', '紫', '舞', '法子', '加奈', '亚里沙', '加奈子', '沙织', '美里', '美穗', '智绘里', '响子', '美由纪', '桃华', '椿', '莲实', '千佳',  '裕美', '优', '爱海', '里奈', '满', '梢', '胡桃', '志希', '未来', '梨华', '早耶', '雪乃', '芙蕾德莉卡', '纱枝', '琴歌', '杏', '菲菲', '小豆', '星花', '雅', '丽奈', '仁美', '歌铃', '清良', '雪菜', '若叶', '里美', '幸子', '都', '风香', '由里子', '菜菜', '忍', '宁宁', '小春', '麻由', '樱', '萤', '美玲', '柑奈', '悠贵', '美世', '晶叶', '朱里', '千岁', '千夜',
 '千秋', '沙理奈', '绫', '礼子', '千夏', '奈绪', '春菜', '比奈', '李衣菜', '圣来', '千枝', '美优', '瞳子', '肇', '美波', '翠', '赖子', '爱丽丝', '文香', '牧野', '七海', '凉', '千奈美', '枫', '兰子', '惠', '志乃', '加莲', '诗织', '穗乃香', '雪美', '礼', '留美', '沙纪', '音叶', '小梅', '彩华', '睦', '奈美', '由爱', '朋', '周子', '珠美', '泰叶', '奏', '泉', '千鹤', '乃乃', '亚季', '晴', '飞鸟', '司', '圣', '茄子', '明', '飒',
 '未央', '蓝子', '芽衣子', '薰', '夏树', '久美子', '洋子', '麻理菜', '美羽', '米莉亚', '渚', '斋', '唯', '友纪', '柚', '铃帆', '菜帆', '雫', '丽奈', '美纱希', '早苗', '裕子', '櫂', '梨沙', '时子', '芳乃', '夕美', '空', '爱结奈', '智香', '美嘉', '莉嘉', '惠磨', '茜', '琪拉莉', '爱梨', '夏美', '志保', '拓海', '仁奈', '日菜子', '海', '真寻', '伊吹', '纱南', '笑美', '菖蒲', '巴', '亚子', '葵', '清美', '心', '光', '璃亚梦', '凪',
 '琴叶', '美奈子', '茉莉', '百合子', '纱代子', '海美', '育', '可奈', '奈绪', '静香', '惠美', '朋花', '步', '千鹤', '瑞希', '莉绪', '昴', '桃子', '䌷', '翼', '埃琳娜', '星梨花', '茜', '杏奈', '日向', '木实', '环', '风花', '美也', '可怜', '丽花', '歌织',
 '真乃', '灯织', '巡', '恋钟', '摩美美', '咲耶', '结华', '雾子', '果穗', '智代子', '树里', '凛世', '夏叶', '甘奈', '甜花', '千雪', '朝日', '冬优子', '爱依', '透', '圆香', '小糸', '雏菜', '羽月'
)

houfa = ('低马尾', '高马尾', '双马尾', '侧单马尾', '麻花辫', '包子头', '呆毛')
qianfa = ('齐刘海', '长刘海', '露额头', '遮眼发')
fase = ('黑色', '红色', '橙色', '金色', '黄色', '绿色', '蓝色', '紫色', '粉色', '棕色', '银色', '灰色', '白色', '彩虹色')
faxing = ('长发', '短发')

tongse = ('黑色', '红色', '橙色', '金色', '黄色', '绿色', '蓝色', '紫色', '粉色', '棕色', '银色', '灰色', '白色', '异色')
yanxing = ('丹凤眼', '垂眼', '半睁眼', '猫眼', '死鱼眼', '眯眯眼', '大眼')

ouBaiSize=('70A','70B','70C','70D','75A','75B','75C','75D','75E','80A','80B','80C','80D','80E','85B','85C','85D','85E')

qianxingge = ('傲娇', '病娇', '弱娇', '高冷', '慵懒', '三无', '无口', '笨蛋', '呆萌', '天然黑', '认真', '电波', '冒失', '工口', '毒舌', '元气', '强气', '狂气', '弱气', '怕羞', '爱哭', '好奇', '胆小', '耿直', '猫系', '犬系')
shenxingge = ('腹黑', '热血', '女王', '戏精', '多重人格', '少女心', '温柔', '恋爱脑', '老好人', 'S', 'M', '小恶魔', '常识人', '单纯', '孤僻', '闷骚', '脱线', '早熟')

jinhua = ('萝莉', '少女', '少女', '御姐')
